Public Attributes | List of all members
API_DailyProfile Struct Reference
Attribute Management
Describes a daily profile contained in Operation Profile. More...
#include <APIdefs_Attributes.h>
 Public Attributes
GS::uchar_t  | name [API_UniLongNameLen]
The name of the daily profile.
double  | minTemp [24]
Hourly desired minimum temperature in a day.
bool  | minTempDefs [24]
Minimum temperature defines.
double  | maxTemp [24]
Hourly desired maximum temperature in a day.
bool  | maxTempDefs [24]
Maximum temperature defines.
double  | occupancyCount [24]
Hourly occupancy count in a day.
double  | lightGain [24]
Hourly light gain in a day.
double  | equipmentGain [24]
Hourly equipment gain in a day.
Detailed Description
Describes a daily profile contained in Operation Profile.
Member Data Documentation
◆ equipmentGain
 API_DailyProfile::equipmentGain
Hourly equipment gain in a day.
◆ lightGain
 API_DailyProfile::lightGain
Hourly light gain in a day.
◆ maxTemp
 API_DailyProfile::maxTemp
Hourly desired maximum temperature in a day.
◆ maxTempDefs
 API_DailyProfile::maxTempDefs
Maximum temperature defines.
◆ minTemp
 API_DailyProfile::minTemp
Hourly desired minimum temperature in a day.
◆ minTempDefs
 API_DailyProfile::minTempDefs
Minimum temperature defines.
◆ name
 API_DailyProfile::name
The name of the daily profile.
◆ occupancyCount
 API_DailyProfile::occupancyCount
Hourly occupancy count in a day.